orificemeter/orifice_meter/case_file/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 0)              // 0
    (4 -0.17464377 0)    // 1
    (4  0.17464377 0)    // 2
    (8 -0.34928754 0)    // 3
    (8  0.34928754 0)    // 4
    (0 0 320)            // 5
    (4 -0.17464377 320)// 6
    (4  0.17464377 320)// 7
    (8 -0.34928754 320)// 8
    (8  0.34928754 320)// 9
    (0 0 333)          // 10
    (4 -0.17464377 333)// 11
    (4  0.17464377 333)// 12
    (8 -0.34928754 333)// 13
    (8  0.34928754 333)// 14
    (0 0 653)          // 15
    (4 -0.17464377 653)// 16
    (4  0.17464377 653)// 17
    (8 -0.34928754 653)// 18
    (8  0.34928754 653)// 19
);




blocks
(
    hex (0 1 2 0 5 6 7 5) (92 1 320) simpleGrading (1 1 1)         // 0
    hex (1 3 4 2 6 8 9 7) (92 1 320) simpleGrading (1 1 1)         // 1
    hex (5 6 7 5 10 11 12 10) (92 1 13) simpleGrading (1 1 1)      // 2
    hex (10 11 12 10 15 16 17 15) (92 1 320) simpleGrading (1 1 1) // 3
    hex (11 13 14 12 16 18 19 17) (92 1 320) simpleGrading (1 1 1) // 4
);



boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 0 0 2)
            (3 1 2 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (16 15 15 17)
            (18 16 17 19)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (4 9 8 3)
            (7 12 11 6)
            (14 19 18 13)
            (6 7 9 8)
            (11 12 14 13)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 5 5 0)
            (5 10 10 5)
            (10 15 15 10)
        );
    }
    frontAndBack_pos
    {
        type wedge;
        faces
        (
            (2 0 5 7)
            (12 10 15 17)
            (7 5 10 12)
            (4 2 7 9)
            (14 12 17 19)
        );
    }


    frontAndBack_neg
    {
        type wedge;
        faces
        (
            (0 1 6 5)
            (5 6 11 10)
            (11 16 15 10)
            (1 3 8 6)
            (11 13 18 16)
        );
    }
);

// ************************************************************************* //
