orificemeter/orifice_meter/case_file/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          184;
        startFace       236983;
    }
    outlet
    {
        type            patch;
        nFaces          184;
        startFace       237167;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          837;
        startFace       237351;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       238188;
    }
    frontAndBack_pos
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          118956;
        startFace       238188;
    }
    frontAndBack_neg
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          118956;
        startFace       357144;
    }
)

// ************************************************************************* //
